# Reading Data

* Python has a large number of different ways to read data from external files. 
* Python supports almost any type of file you can think of, from simple text files to complex binary formats.
* In this class we are going to mainly use the pakage **`pandas`** to load external files.
* `pandas` loads data into an object called a `DataFrame` - think of it as a table.
* `DataFrames` are very useful, since there are lots of built-in methods that allow us to easily manipulate the data.

---

# The `pandas` package - `DataFrame`

In [3]:
import pandas as pd

In [4]:
!ls Data                          # You can run command-line commads by putting a "!" at the beginning

Doctor.csv  Mess.csv  Planets.csv

In [5]:
!head -3 Data/Planets.csv

Name,a,
Mercury,0.3871,0.2056
Venus,0.7233,0.0068

In [6]:
planet_table = pd.read_csv('./Data/Planets.csv')

In [7]:
planet_table

,Name,a,Unnamed: 2
0,Mercury,0.3871,0.2056
1,Venus,0.7233,0.0068
2,Earth,0.9991,0.0166
3,Mars,1.5237,0.0935
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
6,Uranus,19.1727,0.0486
7,Neptune,29.9769,0.0088
8,Halley,17.8589,0.9680

In [8]:
print(planet_table)

      Name        a  Unnamed: 2
0  Mercury   0.3871      0.2056
1    Venus   0.7233      0.0068
2    Earth   0.9991      0.0166
3     Mars   1.5237      0.0935
4  Jupiter   5.2016      0.0490
5   Saturn   9.5424      0.0547
6   Uranus  19.1727      0.0486
7  Neptune  29.9769      0.0088
8   Halley  17.8589      0.9680

### Notice that each row has an `index` assigned to it.

## Renaming columns

In [9]:
planet_table.rename(columns={'Unnamed: 2': 'ecc'}, inplace=True)

planet_table

,Name,a,ecc
0,Mercury,0.3871,0.2056
1,Venus,0.7233,0.0068
2,Earth,0.9991,0.0166
3,Mars,1.5237,0.0935
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
6,Uranus,19.1727,0.0486
7,Neptune,29.9769,0.0088
8,Halley,17.8589,0.9680

In [10]:
planet_table['Name']

0    Mercury
1      Venus
2      Earth
3       Mars
4    Jupiter
5     Saturn
6     Uranus
7    Neptune
8     Halley
Name: Name, dtype: object

In [11]:
planet_table['Name'][0]

'Mercury'

## Sorting

In [12]:
planet_table.sort_values(['ecc'])

,Name,a,ecc
1,Venus,0.7233,0.0068
7,Neptune,29.9769,0.0088
2,Earth,0.9991,0.0166
6,Uranus,19.1727,0.0486
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
3,Mars,1.5237,0.0935
0,Mercury,0.3871,0.2056
8,Halley,17.8589,0.9680

In [13]:
planet_table.sort_values(['ecc'], ascending=False)

,Name,a,ecc
8,Halley,17.8589,0.9680
0,Mercury,0.3871,0.2056
3,Mars,1.5237,0.0935
5,Saturn,9.5424,0.0547
4,Jupiter,5.2016,0.0490
6,Uranus,19.1727,0.0486
2,Earth,0.9991,0.0166
7,Neptune,29.9769,0.0088
1,Venus,0.7233,0.0068

#### The original table is unchanged

In [14]:
planet_table

,Name,a,ecc
0,Mercury,0.3871,0.2056
1,Venus,0.7233,0.0068
2,Earth,0.9991,0.0166
3,Mars,1.5237,0.0935
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
6,Uranus,19.1727,0.0486
7,Neptune,29.9769,0.0088
8,Halley,17.8589,0.9680

#### To `save` the sort, assign the sorted table to a new variable:

In [15]:
sorted_table = planet_table.sort_values(['ecc'])

In [16]:
sorted_table

,Name,a,ecc
1,Venus,0.7233,0.0068
7,Neptune,29.9769,0.0088
2,Earth,0.9991,0.0166
6,Uranus,19.1727,0.0486
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
3,Mars,1.5237,0.0935
0,Mercury,0.3871,0.2056
8,Halley,17.8589,0.9680

### Notice that the index has **NOT** been reordered!

In [18]:
sorted_table['Name'][0]

'Mercury'

### You can fix this by resetting the index

In [19]:
sorted_table = planet_table.sort_values(['ecc']).reset_index(drop=True)

In [20]:
sorted_table

,Name,a,ecc
0,Venus,0.7233,0.0068
1,Neptune,29.9769,0.0088
2,Earth,0.9991,0.0166
3,Uranus,19.1727,0.0486
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
6,Mars,1.5237,0.0935
7,Mercury,0.3871,0.2056
8,Halley,17.8589,0.9680

In [21]:
sorted_table['Name'][0]

'Venus'

## Masking

In [22]:
mask1 = planet_table['a'] > 5

mask1

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
Name: a, dtype: bool

In [23]:
planet_table[mask1]

,Name,a,ecc
4,Jupiter,5.2016,0.0490
5,Saturn,9.5424,0.0547
6,Uranus,19.1727,0.0486
7,Neptune,29.9769,0.0088
8,Halley,17.8589,0.9680

In [24]:
mask2 = ((planet_table['a'] > 5) &
         (planet_table['ecc'] < 0.05))

planet_table[mask2]

,Name,a,ecc
4,Jupiter,5.2016,0.0490
6,Uranus,19.1727,0.0486
7,Neptune,29.9769,0.0088

In [25]:
masked_table = planet_table[mask2].reset_index(drop=True)
masked_table

,Name,a,ecc
0,Jupiter,5.2016,0.0490
1,Uranus,19.1727,0.0486
2,Neptune,29.9769,0.0088

## Adding a column to the Table
* perihelion distance$\ = a(1-e)$

In [26]:
perihelion = planet_table['a'] * (1.0 - planet_table['ecc'])

In [27]:
perihelion

0     0.307512
1     0.718382
2     0.982515
3     1.381234
4     4.946722
5     9.020431
6    18.240907
7    29.713103
8     0.571485
dtype: float64

In [28]:
planet_table['Perihelion'] = perihelion

In [29]:
planet_table

,Name,a,ecc,Perihelion
0,Mercury,0.3871,0.2056,0.307512
1,Venus,0.7233,0.0068,0.718382
2,Earth,0.9991,0.0166,0.982515
3,Mars,1.5237,0.0935,1.381234
4,Jupiter,5.2016,0.0490,4.946722
5,Saturn,9.5424,0.0547,9.020431
6,Uranus,19.1727,0.0486,18.240907
7,Neptune,29.9769,0.0088,29.713103
8,Halley,17.8589,0.9680,0.571485

## Saving a table

In [30]:
planet_table.to_csv('./Data/NewPlanets2.csv', index=False)

In [31]:
!cat Data/NewPlanets2.csv

Name,a,ecc,Perihelion
Mercury,0.3871,0.2056,0.30751224
Venus,0.7233,0.0068,0.7183815600000001
Earth,0.9991,0.0166,0.9825149400000001
Mars,1.5237,0.0935,1.38123405
Jupiter,5.2016,0.049,4.9467216
Saturn,9.5424,0.0547,9.02043072
Uranus,19.1727,0.0486,18.24090678
Neptune,29.9769,0.0088,29.71310328
Halley,17.8589,0.968,0.5714848000000005

---

# Messy Data

* `pandas` is a good choice when working with messy data files.
* In the "real world" all data is messy.

## `pandas` is really good for working with dates!

In [32]:
import datetime
import numpy as np

In [33]:
doctor_table = pd.read_csv('./Data/Doctor.csv')

In [34]:
doctor_table

,Name,BirthDate,DrDate,BirthCity,BirthCountry
0,William Hartnell,8/01/1908,11/23/1963,London,England
1,Patrick Troughton,25 March 1920,29 October 1966,London,England
2,Jon Pertwee,7 July 1919,3 January 1960,London,England
3,Tom Baker,20-January-1934,8-June-1974,Liverpool,England
4,Peter Davison,13 April 1951,21 March 1981,London,England
5,Colin Baker,8/June/1943,16/March/1984,London,England
6,Sylvester McCoy,20 August 1943,7 September 1987,Dunoon,Scotland
7,Paul McGann,14/11/1959,27/5/1996,Liverpool,England
8,John Hurt,22 January 1940,18 May 2013,Derbyshire,England
9,Chris Eccleston,16 Feb 1964,26 March 2005,Salford,England
10,David Tennant,18 April 1971,18 June 2005,Bathgate,Scotland
11,Matt Smith,28-10-1982,1-1-2010,Northampton,England
12,Peter Capaldi,14 April 1958,25 December 2013,Glasgow,Scotland
13,Jodie Whittaker,06/03/1982,25/12/2017,Yorkshire,England

In [35]:
doctor_table.sort_values(['BirthDate'])

,Name,BirthDate,DrDate,BirthCity,BirthCountry
13,Jodie Whittaker,06/03/1982,25/12/2017,Yorkshire,England
4,Peter Davison,13 April 1951,21 March 1981,London,England
12,Peter Capaldi,14 April 1958,25 December 2013,Glasgow,Scotland
7,Paul McGann,14/11/1959,27/5/1996,Liverpool,England
9,Chris Eccleston,16 Feb 1964,26 March 2005,Salford,England
10,David Tennant,18 April 1971,18 June 2005,Bathgate,Scotland
6,Sylvester McCoy,20 August 1943,7 September 1987,Dunoon,Scotland
3,Tom Baker,20-January-1934,8-June-1974,Liverpool,England
8,John Hurt,22 January 1940,18 May 2013,Derbyshire,England
1,Patrick Troughton,25 March 1920,29 October 1966,London,England
11,Matt Smith,28-10-1982,1-1-2010,Northampton,England
2,Jon Pertwee,7 July 1919,3 January 1960,London,England
0,William Hartnell,8/01/1908,11/23/1963,London,England
5,Colin Baker,8/June/1943,16/March/1984,London,England

In [36]:
doctor_table['BirthDate'] = pd.to_datetime(doctor_table['BirthDate'])
doctor_table['DrDate'] = pd.to_datetime(doctor_table['DrDate'])

In [37]:
doctor_table.sort_values(['BirthDate'])

,Name,BirthDate,DrDate,BirthCity,BirthCountry
0,William Hartnell,1908-08-01,1963-11-23,London,England
2,Jon Pertwee,1919-07-07,1960-01-03,London,England
1,Patrick Troughton,1920-03-25,1966-10-29,London,England
3,Tom Baker,1934-01-20,1974-06-08,Liverpool,England
8,John Hurt,1940-01-22,2013-05-18,Derbyshire,England
5,Colin Baker,1943-06-08,1984-03-16,London,England
6,Sylvester McCoy,1943-08-20,1987-09-07,Dunoon,Scotland
4,Peter Davison,1951-04-13,1981-03-21,London,England
12,Peter Capaldi,1958-04-14,2013-12-25,Glasgow,Scotland
7,Paul McGann,1959-11-14,1996-05-27,Liverpool,England
9,Chris Eccleston,1964-02-16,2005-03-26,Salford,England
10,David Tennant,1971-04-18,2005-06-18,Bathgate,Scotland
13,Jodie Whittaker,1982-06-03,2017-12-25,Yorkshire,England
11,Matt Smith,1982-10-28,2010-01-01,Northampton,England

In [38]:
doctor_age = doctor_table['DrDate'] - doctor_table['BirthDate']

In [39]:
doctor_age

0    20202 days
1    17019 days
2    14790 days
3    14749 days
4    10935 days
5    14892 days
6    16089 days
7    13344 days
8    26780 days
9    15014 days
10   12480 days
11    9927 days
12   20344 days
13   12989 days
dtype: timedelta64[ns]

In [40]:
doctor_table['DrAge'] = doctor_age / np.timedelta64(1, 'Y')

In [41]:
doctor_table.sort_values(['DrAge'])

,Name,BirthDate,DrDate,BirthCity,BirthCountry,DrAge
11,Matt Smith,1982-10-28,2010-01-01,Northampton,England,27.179203
4,Peter Davison,1951-04-13,1981-03-21,London,England,29.939013
10,David Tennant,1971-04-18,2005-06-18,Bathgate,Scotland,34.169079
13,Jodie Whittaker,1982-06-03,2017-12-25,Yorkshire,England,35.562674
7,Paul McGann,1959-11-14,1996-05-27,Liverpool,England,36.534631
3,Tom Baker,1934-01-20,1974-06-08,Liverpool,England,40.381390
2,Jon Pertwee,1919-07-07,1960-01-03,London,England,40.493645
5,Colin Baker,1943-06-08,1984-03-16,London,England,40.772911
9,Chris Eccleston,1964-02-16,2005-03-26,Salford,England,41.106936
6,Sylvester McCoy,1943-08-20,1987-09-07,Dunoon,Scotland,44.050186
1,Patrick Troughton,1920-03-25,1966-10-29,London,England,46.596439
0,William Hartnell,1908-08-01,1963-11-23,London,England,55.311197
12,Peter Capaldi,1958-04-14,2013-12-25,Glasgow,Scotland,55.699980
8,John Hurt,1940-01-22,2013-05-18,Derbyshire,England,73.321150

In [42]:
doctor_table.sort_values(['BirthCountry', 'DrAge'])

,Name,BirthDate,DrDate,BirthCity,BirthCountry,DrAge
11,Matt Smith,1982-10-28,2010-01-01,Northampton,England,27.179203
4,Peter Davison,1951-04-13,1981-03-21,London,England,29.939013
13,Jodie Whittaker,1982-06-03,2017-12-25,Yorkshire,England,35.562674
7,Paul McGann,1959-11-14,1996-05-27,Liverpool,England,36.534631
3,Tom Baker,1934-01-20,1974-06-08,Liverpool,England,40.381390
2,Jon Pertwee,1919-07-07,1960-01-03,London,England,40.493645
5,Colin Baker,1943-06-08,1984-03-16,London,England,40.772911
9,Chris Eccleston,1964-02-16,2005-03-26,Salford,England,41.106936
1,Patrick Troughton,1920-03-25,1966-10-29,London,England,46.596439
0,William Hartnell,1908-08-01,1963-11-23,London,England,55.311197
8,John Hurt,1940-01-22,2013-05-18,Derbyshire,England,73.321150
10,David Tennant,1971-04-18,2005-06-18,Bathgate,Scotland,34.169079
6,Sylvester McCoy,1943-08-20,1987-09-07,Dunoon,Scotland,44.050186
12,Peter Capaldi,1958-04-14,2013-12-25,Glasgow,Scotland,55.699980

In [43]:
doctor_table.describe()

,DrAge
count,14.000000
mean,42.937031
std,11.973941
min,27.179203
25%,35.805663
50%,40.633278
75%,45.959876
max,73.321150

## More messy data

In [44]:
!cat Data/Mess.csv

#######################################################
#
# Col 1 - Name
# Col 2 - Size (km)
#
#######################################################
"Sample 1",10
"",23
,
"Another Sample",

### This is not going to end well ...

In [45]:
messy_table = pd.read_csv('./Data/Mess.csv')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 7, saw 2

### Tell `pandas` about the comments:

In [46]:
messy_table = pd.read_csv('./Data/Mess.csv', comment = "#")

messy_table

,Sample 1,10
0,NaN,23.0
1,NaN,NaN
2,Another Sample,NaN

`NaN` = Not_A_Number, python's null value

## Not quite correct ...

### Turn off the header

In [47]:
messy_table = pd.read_csv('./Data/Mess.csv', comment = "#", header= None)

messy_table

,0,1
0,Sample 1,10.0
1,NaN,23.0
2,NaN,NaN
3,Another Sample,NaN

### Add the column names

In [48]:
cols = ["Name", "Size"]

messy_table = pd.read_csv('./Data/Mess.csv', comment = "#", header= None, names = cols)

messy_table

,Name,Size
0,Sample 1,10.0
1,NaN,23.0
2,NaN,NaN
3,Another Sample,NaN

### Deal with the missing data with `fillna()`

In [49]:
messy_table['Name'].fillna("unknown", inplace=True)
messy_table['Size'].fillna(999.0, inplace=True)

messy_table

,Name,Size
0,Sample 1,10.0
1,unknown,23.0
2,unknown,999.0
3,Another Sample,999.0